W11D4/BenchBnB/BenchBnb/app/models/user.rb

    def reset_session_token!
        self.session_token = generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "F22pFQBR6_z10TYEj9yzNQ"], ["updated_at", "2021-05-27 23:59:12.832005"], ["id", 1]]